Repository: 84000/data-translation-memory
Catalog: toh129-v4.tmx
Source language: bo
Languages: en

source: །མཉམ་པ་ཉིད་དུ་ཤེས་པའི་ཚུལ་གྱིས་གང་སྐྱེ་མཆེད་བཅུ་གཉིས་ལ་འདུ་ཤེས་ཕྱིན་ཅི་ལོག་མེད་པ་དང་། སེམས་ཕྱིན་ཅི་ལོག་མེད་པ་དང་ལྟ་བ་ཕྱིན་ཅི་ལོག་མེད་པ་དང་། གདེག་པ་མེད་པ་དང་། གཞག་པ་མེད་པ་དེ་ནི་ཆོས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་ཞེས་བྱའོ།
en: With the knowledge of sameness, they have no erroneous notions regarding the twelve sense sources, nor do they have any erroneous mind states or views, and they do not advance or posit anything. That is the application of mindfulness of phenomena that accords with phenomena.

source: །ཆོས་ཀྱི་དབྱིངས་དབྱེར་མེད་པའི་ཚུལ་གྱིས་གང་གཟུགས་ལ་མི་སྐྱེ་བ་དང་མི་འགག་པ་དང་གནས་པ་མེད་པར་ཤེས་ཤིང་།དགེ་བ་དང་མི་དགེ་བའི་འདུ་ཤེས་དང་ཡང་མི་འདུ་བ་
en: “Since they understand the indivisible nature of the realm of phenomena, they know form to be unborn, unceasing, and non-abiding, and they do not entertain any notions of virtue or nonvirtue.

source: དེ་ནི་སྡིག་པ་མི་དགེ་བའི་སེམས་དང་སེམས་ལས་བྱུང་བའི་ཆོས་སྐྱེས་པ་རྣམས་སྤང་བའི་ཡང་དག་པར་སྤོང་བ་ཞེས་བྱའོ།
en: That is the thorough relinquishment that abandons all phenomena related to negative and nonvirtuous minds and those mental states that have already arisen.

source: །ཡིད་ལ་བྱེད་པ་མེད་པའི་ཚུལ་གྱིས་གང་གཟུགས་ལ་མི་སྐྱེ་བ་དང་མི་འགག་པ་དང་གནས་པ་མེད་པར་ཤེས་ཤིང་། སྡུག་བསྔལ་ལས་ཤིན་ཏུ་མི་འདའ་བའི་ཚུལ་གྱིས་གདེག་པ་མེད་ཅིང་གཞག་པ་མེད་ལ།
en: Since they have no conceptual activity, they know form to be unborn, unceasing, and non-abiding, and, by not transcending suffering, they do not interpolate or reduce.

source: སྡིག་པ་ལ་གནས་པ་མེད་དེ་སྤོང་བ་དེ་ནི་སྡིག་པ་མི་དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་མི་སྐྱེད་པའི་ཡང་དག་པར་སྤོང་བ་ཞེས་བྱའོ།
en: Thus, by not dwelling on form, they abandon nonvirtue. That is their thorough relinquishment that avoids the arising of evil and those nonvirtuous phenomena that have not yet arisen.

source: །ཡིད་ལ་བྱེད་པ་མེད་པའི་ཚུལ་གྱིས་གང་གཟུགས་མཐོང་ནས་ཁམས་དང་སྐྱེ་མཆེད་མི་སྐྱེ་བ་དང་མི་འགག་པ་དང་གནས་པ་མེད་པར་ཤེས་ཤིང་
en: Since they have no conceptual activity, they know all visual forms to be unborn, unceasing, and non-abiding.

source: ཆོས་ཀྱི་དབྱིངས་མཉམ་པ་ཉིད་མི་སྐྱེ་བའི་ཚུལ་གྱིས་གདེག་པ་མེད་ཅིང་གཞག་པ་མེད་ལ།
en: Moreover, since they understand that the realm of phenomena is unborn sameness, they do not label or posit anything.

source: མི་དགེ་བ་མི་དམིགས་ཤིང་།དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་སྐྱེད་པ་
en: Thus, without any observation of nonvirtue, they give rise to those virtuous phenomena that have not yet come into being.

source: དེ་ནི་དགེ་བའི་ཆོས་མ་སྐྱེད་པ་རྣམས་སྐྱེད་པའི་ཡང་དག་པར་སྤོང་བ་ཞེས་བྱའོ།
en: That is the thorough relinquishment that gives rise to virtuous phenomena that have not yet come into being.

source: །ཡིད་ལ་བྱེད་པ་མེད་པའི་ཚུལ་གྱིས་གང་གཟུགས་ལ་སྐྱེ་བ་མེད་པ་དང་འགག་པ་མེད་པ་དང་གནས་པ་མེད་པར་ཤེས་ཤིང་།
en: Since they have no conceptual activity, they know form to be unborn, unceasing, and non-abiding.

source: གནས་མེད་པ་དང་སྐྱེ་བ་མེད་པ་དང་འགག་པ་མེད་པ་དང་གནས་པ་མེད་པའི་ཚུལ་གྱིས་གདེག་པ་མེད་ཅིང་གཞག་པ་མེད་ལ།
en: Since they know that form is non-abiding, unborn, and unceasing, they do not label or posit anything.

source: དགེ་བ་མི་དམིགས་པར་དགེ་བ་སྦྱོར་བ་དེ་ནི་དགེ་བའི་ཆོས་རྣམས་གནས་པར་བྱ་བ་ཡང་དག་པར་སྤོང་བ་ཞེས་བྱའོ།
en: Instead, they practice virtue without perceiving virtue. That is the thorough relinquishment that ensures that virtuous phenomena continue.

source: །ཉམས་པ་མེད་པའི་ཚུལ་གྱིས་གང་གཟུགས་ལ་གནས་མེད་ཅིང་སྒྲིབ་པ་མེད་པར་འདུན་ལ་ཆོས་ཀྱི་དབྱིངས་མཉམ་པ་ཉིད་ཀྱི་ཚུལ་གྱིས་ཁ་དོག་གི་སྣང་བ་ཐམས་ཅད་ཀྱིས་གཟུགས་ཁྱབ་ལ།
en: “By way of not being affected, they are intent not to dwell on form but to remain unobscured with regard to it. Moreover, due to the sameness of the realm of phenomena, they pervade form with all appearances of color.

source: ཇི་ལྟར་ཡོངས་སུ་སྨིན་པ་བཞིན་དུ་འདུལ་བར་འདུན་པ་དེ་ནི་འདུན་པའི་ཏིང་ངེ་འཛིན་རྫུ་འཕྲུལ་གྱི་རྐང་པ་ཞེས་བྱའོ།
en: They also have the intention to tame others in accord with their level of maturation. That is the basis of miraculous power in terms of the meditative absorption of intention.

source: །རྒྱུན་མི་ཆད་པའི་ཚུལ་དང་ཕྱི་མའི་མཐའི་མུར་རྒྱུན་མི་གཅོད་པའི་ཚུལ་དང་། གཞག་པ་མེད་པའི་ཚུལ་གྱིས་གང་གཟུགས་ལ་བླང་བ་མེད་པ་དང་། དོར་བ་མེད་པའི་བརྩོན་འགྲུས་དང་མངོན་པར་འདུ་མི་བྱེད་པའི་རྫུ་འཕྲུལ་གྱིས་འདུལ་བ་ཡོངས་སུ་སྨིན་པ་བཞིན་དུ་འདུལ་བར་སྤྲོ་བ་འདི་ནི་ཆོས་ཉིད་དབྱེར་མེད་པས་བརྩོན་འགྲུས་ཀྱི་ཏིང་ངེ་འཛིན་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཐོབ་པ་མེད་པའི་ཚུལ་གྱིས་རྫུ་འཕྲུལ་གྱི་རྐང་པ་ཞེས་བྱའོ།
en: “They are uninterrupted and continue forever without end. Therefore, with regard to form, they possess a diligence that is free from accepting and rejecting. As such they delight in maturing those to be tamed by means of their miraculous displays that are beyond conditioning. By means of the indivisibility of reality, they obtain the basis of miraculous power related to diligence, which is also the absorption of the Thus-Gone One’s wisdom beyond attainment.

source: །གང་གཟུགས་ལ་སེམས་མི་འཛིན་ཅིང་སྦྱོར་བ་མེད་པས་མཉམ་པ་ཉིད་དང་དམིགས་པ་ལས་ཤིན་ཏུ་འདའ་བ་དང་།
en: “Since they are free from clinging to and engaging with form, they rest in sameness and have utterly transcended observation.

source: དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་ཕྱག་རྒྱ་ལ་གནས་པ་དང་། བསམ་གཏན་མཁའ་ཁྱབ་ལ་སྙོམས་པར་འཇུག་པ་
en: In this way they abide within the seal of the Thus-Gone One’s wisdom and rest in equipoise within his all-pervasive concentration.

source: དེ་ནི་དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་ཐོབ་པར་བྱེད་པའི་སེམས་རྫུ་འཕྲུལ་གྱི་རྐང་པ་ཞེས་བྱའོ།
en: That is the basis of miraculous power related to attention, which attains the miracles of the Thus-Gone One.

source: །དཔྱོད་པ་མེད་པའི་ཡེ་ཤེས་ཀྱི་ཚུལ་གྱིས་གཟུགས་ལ་སྐྱེ་བ་མེད་པར་ཤེས་པ་ལ་གཅིག་ཏུ་ངེས་པ་དང་། དབྱེར་མེད་པའི་ཚུལ་གྱིས་མཚན་ཉིད་ཐམས་ཅད་མཚན་ཉིད་གཅིག་ཏུ་རྟོགས་པར་དཔྱོད་པ་དང་།
en: “Due to the wisdom that lies beyond discernment, they know with certainty that form is unborn, and, due to the indivisible nature, they discern all characteristics to be of a single nature.

source: དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་དཔྱོད་པས་རྣམ་པར་འཕྲུལ་པ་དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཚིམ་པར་བྱེད་པས་དཔྱོད་པ་རྫུ་འཕྲུལ་གྱི་རྐང་པ་ཞེས་བྱའོ།
en: As they discern the wisdom of the Thus-Gone One, their magical manifestations satisfy the minds of all beings. That is the basis of miraculous power related to discernment.

source: །ཆོས་ཐམས་ཅད་ཐོབ་པ་མེད་པའི་ཚུལ་གྱིས་གང་གཟུགས་ལ་དམིགས་པ་ཐམས་ཅད་གནས་མེད་པར་དད་པ་དང་དབང་པོ་ལ་རྟོག་པ་དང་
en: “As all phenomena are beyond attainment, they are not fixated on any visual observation of form. In this way they feel faith and take hold of that faculty of faith.

source: གཟུགས་དང་གཟུགས་མེད་པ་མཉམ་པ་ཉིད་དུ་གྱུར་པའི་ཆོས་རྣམས་ལ་དད་པ་དང་།
en: They also feel a faith in all qualities where both form and the formless have been equalized.

source: དབང་པོ་ཞུམ་པ་མེད་པས་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ལ་དད་པ་དེ་ནི་དད་པའི་དབང་པོ་ཞེས་བྱའོ།
en: With the faculty undiminished, they produce faith in the wisdom of the Thus-Gone One. That is the faculty of faith.

source: །གདེག་པ་མེད་པ་དང་གཞག་པ་མེད་པའི་ཚུལ་གྱིས་གང་གཟུགས་ལ་དམིགས་པ་ཐམས་ཅད་མགོ་གཅིག་ཏུ་གྱུར་པ་དང་། རྣལ་འབྱོར་གྱི་རྒྱུན་མི་གཅོད་པ་དེ་ནི་བརྩོན་འགྲུས་ཞེས་བྱ་སྟེ།
en: “Being free from reducing or interpolating anything, all observation with regard to form turns into a single gateway, and the continuity of practice becomes unbroken. This is known as diligence.

source: མི་དམིགས་པའི་ཚུལ་གྱིས་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་རྒྱུན་མི་གཅོད་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ཞེས་བྱའོ།
en: Then, in a manner beyond observation, the wisdom of the Thus-Gone One becomes unbroken. That is the faculty of diligence.

source: །དེ་བཞིན་གཤེགས་པའི་གནས་ལ་དབང་པོ་འཇུག་པའི་ཚུལ་གྱིས་གང་གཟུགས་ལ་དྲན་པ་མེད་ཅིང་ཡིད་ལ་བྱེད་པ་མེད་པའི་ཚུལ་གྱིས་དམིགས་པ་ལས་ཤིན་ཏུ་འདས་ནས་གཅིག་དྲན་ཏེ།
en: “By applying their faculties to the abode of the Thus-Gone One, with regard to form the bodhisattvas go beyond mindfulness and transcends all observation, thus becoming singularly mindful.

source: དུས་གསུམ་མཚན་ཉིད་གཅིག་ཏུ་དྲན་པ་དེ་ནི་དྲན་པ་ཞེས་བྱ་སྟེ།
en: In this way they are mindful of the single characteristic throughout the three times. That is what is referred to as mindfulness.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་སེམས་སུ་མཚུངས་པས། དམིགས་པ་གཅིག་གིས་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཁྱབ་པ་དང་།
en: As the minds of all beings are all equal in being mind, a single observation pervades all the realms of beings.

source: དེ་བཞིན་གཤེགས་པ་མཐོང་བའི་བྱིན་གྱི་རླབས་དེ་ནི་དྲན་པའི་དབང་པོ་ཞེས་བྱའོ།
en: This transformative power of the perception of the Thus-Gone One is the faculty of mindfulness.

source: །སྐྱེ་བ་མེད་པ་དང་འགག་པ་མེད་པ་དང་གཡེང་བ་མེད་པའི་ཚུལ་གྱིས་གང་གཟུགས་ལ་ཡིད་ལ་བྱེད་པ་ཐམས་ཅད་གཅིག་པ་དང་།
en: “As they are free from birth, cessation, and distraction, all mental activity with regard to form has merged into one.

source: གཟུགས་དང་གཟུགས་མེད་པའི་ཏིང་ངེ་འཛིན་དམིགས་པ་གཅིག་པ་དང་མཚན་ཉིད་ཐམས་ཅད་མཚན་ཉིད་གཅིག་སྟེ།
en: The absorptions of form and the formless have merged into one point, as have all features.

source: གཡེང་བ་མེད་པ་དང་དེ་བཞིན་གཤེགས་པའི་དབང་པོ་ལ་འཇུག་པའི་ཡེ་ཤེས་དང་། རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ཐུན་མོང་མ་ཡིན་པ་དེ་ནི་ཏིང་ངེ་འཛིན་ཅེས་བྱ་སྟེ།
en: Being undistracted in the wisdom that engages the faculty of the Thus-Gone One, as well as being undistracted in the extraordinary vajra-like absorption, is what is known as absorption.

source: ཏིང་ངེ་འཛིན་ཐམས་ཅད་སྐྱེ་བ་མེད་པའི་ཚུལ་དང་། གཡེང་བ་མེད་ཅིང་མི་ཐུལ་བས་ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་ཞེས་བྱའོ།
en: All absorptions are unborn, and they are free of distraction and becomes unassailable. That is the faculty of absorption.

source: །གང་གཟུགས་ལ་གནས་མེད་པའི་ཤེས་རབ་དང་ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་དང་། སྐྱེ་བ་མེད་པའི་མཐར་ཡང་དག་པར་འདུས་པའི་སྤྱོད་པ་དང་།
en: “With regard to form, the bodhisattvas engage in the activity that comprises all non-abiding insight, absorptions, equipoises, and the unborn limit.

source: ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་པ་ལ་འཇུག་པའི་ཤེས་རབ་ཀྱིས་འདུས་བྱས་དང་འདུས་མ་བྱས་གཉིས་ལས་ཤིན་ཏུ་འདའ་བ་དང་།
en: With the insight that engages the unborn nature of all phenomena, they transcend everything conditioned as well as the unconditioned.

source: གཉེན་པོ་མེད་པའི་ཚུལ་གྱིས་གཟུགས་དེ་ལ་གང་མཚན་ཉིད་གཅིག་ཏུ་འཇུག་པ་
en: Being beyond the need for an antidote, they engage with the single characteristic of form.

source: དེ་ནི་ཤེས་རབ་ཅེས་བྱ་སྟེ།ཉི་ཚེ་བའི་ཤེས་པས་མི་ཐུལ་བའི་ཚུལ་གྱིས་ཤེས་རབ་ཀྱི་དབང་པོ་ཞེས་བྱའོ།
en: That is known as insight, and, since they have become unassailable by fleeting consciousness, it is also known as the faculty of insight.

source: །གང་གཟུགས་ལ་ཆགས་པ་མེད་ཅིང་དམིགས་པ་མེད་ལ་མི་ཐུལ་བའི་དོན་དང་། དད་པས་འཕྲོགས་པ་མེད་པའི་དོན་དེ་ནི་དད་པའི་སྟོབས་ཞེས་བྱའོ།
en: “The power of faith is to be unassailable due to non-attachment and non-observation with regard to form and to never lose faith.

source: །གང་གཟུགས་ལ་ཀུན་ཏུ་འགྲོ་བའི་བྱིན་གྱི་རླབས་ལ་སྤྲོ་བ་དང་། སྟོབས་དང་། སྟོབས་མ་ཡིན་པའི་འདུ་ཤེས་ལས་ཤིན་ཏུ་འདའ་བ་དང་། ཁམས་ལ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྟོབས་སུ་སྒྲུབ་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་སྟོབས་ཞེས་བྱའོ།
en: “The power of diligence is to delight in the transformative power that pervades form, to transcend all notions of being powerful or not, and to accomplish such power of a thus-gone one over the elements.

source: །གང་གཟུགས་ལ་རྣམ་པར་མི་རྟོག་པ་དང་། རྣམ་པར་མི་སྒྲུབ་པ་དང་ལྷུན་གྱིས་གྲུབ་པའི་དྲན་པའི་ཤེས་པ་དང་། ཤིན་ཏུ་མཐར་ཐུག་པ་ལ་འཇུག་པའི་མཆོག་དང་ཡང་དག་པའི་མཐའ་དང་མཚུངས་པ་དང་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་སྐུ་ལ་དྲན་པ་ཉེ་བར་གཞོག་པ་དང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་མི་ཐུལ་བའི་ཤེས་པ་དེ་ནི་དྲན་པའི་སྟོབས་ཞེས་བྱའོ།
en: “The power of mindfulness refers to an absence of concepts and affirmations with regard to form. It is a spontaneous mindful awareness, the supreme engagement in the ultimate, and in accord with the limit of reality. It is an application of mindfulness of the Thus-Gone One’s Dharma body and a knowledge that is unassailable by any hearer or solitary buddha.

source: །གང་གཟུགས་ལ་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་མཐར་ཐུག་པ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ལས་ཡང་དག་པར་སྒྲུབ་པ་དང་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་ལྷུན་གྱིས་གྲུབ་པའི་ཐོབ་པ་དང་། ཕྱིན་ཅི་ལོག་ཐམས་ཅད་ལ་གཡེང་བ་མེད་པ་ཤེས་པ་དེ་ནི་མི་ཐུལ་བའི་ཕྱིར་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་ཞེས་བྱའོ།
en: “The power of absorption refers to being unassailable because of perfecting the Thus-Gone One’s wisdom, gaining accomplishment of the activity of the realm of phenomena, attaining spontaneous accomplishment of the absorption of the thus-gone ones, and actualizing the consciousness that is undistracted from all incorrect mind states with regard to form.

source: །གང་གཟུགས་ལ་ཆོས་ཀྱི་དབྱིངས་འཁྲུགས་པ་མེད་པར་རྟོག་པ་དང་། མཐའ་དང་མཐའ་མ་ཡིན་པ་གཉིས་སུ་མེད་པར་རབ་ཏུ་ཤེས་པ་དང་། རྣམ་པར་གཞག་པའི་མཐའ་ལ་ལྷུན་གྱིས་གྲུབ་པའི་དྲན་པ་ཤེས་པ་དང་གནས་པ་མེད་པའི་དངོས་པོ་རབ་ཏུ་ཤེས་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟོབས་ཞེས་བྱའོ།
en: “The power of insight with regard to form refers to an undisturbed understanding of the realm of phenomena, knowing the nonduality of extremes and no extremes, being spontaneously mindful of meditative composure, and knowing the non-abiding nature.

source: །གང་གཟུགས་ལ་གནས་མེད་པའི་དྲན་པ་མངོན་དུ་ཡང་དག་པར་རྟོག་པ་དང་།
en: “The bodhisattvas realize a mindfulness that is beyond fixation on form.

source: དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ཡུལ་དང་འཐུན་པ་དང་སྐྱེ་བ་མེད་པ་ལ་ཞུགས་པ་རྣམས་ཀྱི་དྲན་པ་ཡིད་ལ་བྱེད་པ་མེད་པའི་ཚུལ་དུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་དེ་ནི་དྲན་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཅེས་བྱའོ།
en: It is in harmony with the domain of the Thus-Gone One and connected with the unborn nature. Due to their nonconceptual mindfulness related to those states, they awaken. This is the branch of awakening concerned with mindfulness.

source: །གང་གཟུགས་ལ་ཆོས་ཀྱི་དབྱིངས་སུ་རབ་ཏུ་ཤེས་པ་དང་། མི་དམིགས་པའི་རྣལ་འབྱོར་གྱི་ཤེས་པས་རབ་ཏུ་རྣམ་པར་འབྱེད་པ་ལ་མཁས་པ་དང་། ཆོས་དང་ཆོས་མ་ཡིན་པ་གཉིས་ཁོང་དུ་ཆུད་པ་དེ་ནི་ཆོས་རབ་ཏུ་རྣམ་པར་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཅེས་བྱའོ།
en: “With regard to form, they know the realm of phenomena, are skilled in analyzing by means of a yogic perception that is beyond observation, and understand the correct and the incorrect. This is the branch of awakening concerned with the analysis of phenomena.

source: །གང་གཟུགས་ལ་རང་བཞིན་གྱིས་ཆོས་ཀྱི་སྐུ་ཡིན་པས་མི་ཐུལ་བར་མངོན་དུ་ཡང་དག་པར་རྟོག་པ་དང་། ཆོས་ཉིད་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་བྱ་བའི་ཕྱིར་བརྩོན་འགྲུས་མི་འདོར་བ་དེ་ནི་བརྩོན་འགྲུས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཅེས་བྱའོ།
en: “Since the nature of form is the Dharma body, they correctly understand this in an unassailable manner and, in order to awaken to the natural state, do not relinquish their diligence. This is the branch of awakening concerned with diligence.

source: །གང་གཟུགས་ལ་དབྱེར་མེད་པར་རབ་ཏུ་རྣམ་པར་འབྱེད་པ་ལ་མཁས་པ་དང་། དཔྱོད་པའི་ཤེས་པ་དང་ལྷུན་གྱིས་གྲུབ་པ་རབ་ཏུ་རྣམ་པར་འབྱེད་པ་བྱ་བ་གནས་མེད་པའི་ཤེས་པའི་ཡང་དག་པར་འགྲུབ་པ་དང་།
en: “With regard to form, they have become skilled in distinguishing its indivisible nature, have mastered examination, fully discerns its natural presence, and have accomplished non-abiding knowledge.

source: ཤིན་ཏུ་སྦྱངས་པའི་ཏིང་ངེ་འཛིན་དང་བཏང་སྙོམས་དང་ཡེ་ཤེས་ཀྱི་དགའ་བ་མྱོང་བའི་ཤེས་པ་དེ་ནི་དགའ་བ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཅེས་བྱའོ།
en: They experience the joy of pliable absorption, equipoise, and wisdom. This is the branch of awakening concerned with joy.

source: །གང་གཟུགས་ལ་དམིགས་པ་ཐམས་ཅད་ཡིད་ལ་བྱེད་པའི་རྒྱུན་མི་གཅོད་པའི་ཤེས་པ་དང་། རྣམ་པར་གྲོལ་བའི་སྐྱེ་མཆེད་ཐམས་ཅད་ལ་དངོས་པོ་དང་དངོས་པོ་མེད་པ་མཉམ་པ་ཉིད་དུ་ཤེས་པ་དེ་ནི་ཤིན་ཏུ་སྦྱངས་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཅེས་བྱའོ།
en: “The bodhisattvas know that the consciousness that continuously engages in observation of form and all sense sources of awakening is a sameness beyond concepts of entity and nonentity. This is the branch of awakening concerned with pliability.

source: །གང་གཟུགས་ལ་རྣམ་པར་བལྟས་ནས་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་ཤེས་པ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་སྒྲིབ་པ་མེད་པའི་རྐྱེན་དང་། ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་གཅིག་ཏུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་དེ་ནི་ཏིང་ངེ་འཛིན་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཅེས་བྱའོ།
en: “When they observe form, they know that all phenomena are sameness. Thus when the circumstances for the stainless branches of awakening, as well as all absorptions and equipoises, have been awakened into one state, that is the branch of awakening concerned with absorption.

source: །གང་གཟུགས་ལ་དངོས་པོ་མེད་པའི་རང་བཞིན་མཉམ་པ་ཉིད་དུ་མངོན་དུ་ཡང་དག་པར་རྟོག་པ་དང་།
en: “The absence of entities with regard to form has been understood to be the state of sameness;

source: གཟུགས་དང་གཟུགས་མེད་པ་ཐམས་ཅད་མཉམ་པ་ཉིད་དང་རབ་ཏུ་འཛིན་པ་དང་། རྩོད་པ་དང་རྣམ་པར་འབྱེད་པ་ལ་བཏང་སྙོམས་པ་དང་ལྷུན་གྱིས་གྲུབ་པ་དང་།
en: they apprehend the sameness of everything—both form and the formless. Likewise, determination and analysis become sameness and are spontaneously accomplished.

source: འདུ་ཤེས་དང་ཡེ་ཤེས་ལ་མཉམ་པ་ཉིད་དང་ཐོབ་པའི་ཆོས་ཐམས་ཅད་མི་སྐྱེད་པ་དང་། རྒྱུ་བ་མེད་པ་དང་ཏིང་ངེ་འཛིན་དང་བཏང་སྙོམས་ཤེས་པ་དང་
en: Identifications and wisdom become sameness. All qualities that have been attained are realized to be unborn, unmoving, absorption, and sameness.

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། ལམ་རྣམས་སྐྱེ་བ་མེད་པའི་མཐའ་དང་ཐོབ་པ་རྣམས་མི་ཚོལ་བ་དེ་ནི་བཏང་སྙོམས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཅེས་བྱའོ།
en: And the branches of awakening, all paths, the unborn limit, and all attainments are no longer sought. This is the branch of awakening concerned with sameness.

source: །གང་གཟུགས་མཐོང་ནས་ཁམས་དང་སྐྱེ་མཆེད་རྣམས་ལ་དངོས་པོ་མེད་པའི་རང་བཞིན་དུ་མཐོང་ཞིང་ཡན་ལག་དང་ཡན་ལག་མེད་པའི་ཚུལ་གྱིས་མཉམ་པ་ཉིད་དུ་མཐོང་བ་དང་། འཕགས་པའི་ལམ་རྣམས་ལམ་མེད་པའི་ཚུལ་གྱིས་ལྟ་བ་དང་མི་འགྲོགས་པ་དང་།
en: “When viewing form, correct view is to see the elements and sense sources as having the nature of non-entities. By way of having parts and not having parts, they are seen as sameness. As the path of the noble ones is seen as not truly a path, the bodhisattva does not entertain any views.

source: འཕགས་པའི་ལམ་རྣམས་དང་ལྟ་བར་གྱུར་པ་ཐམས་ཅད་མཚན་ཉིད་མེད་པར་གཅིག་པའི་ཚུལ་གྱིས་ལྟ་བ་དང་མི་འགྲོགས་པ་དང་། མི་འཁྲུགས་པའི་ཚུལ་གྱིས་ལྟ་བ་ཡང་དག་པ་ཞེས་བྱ་བ་དང་།
en: As the path of the noble ones and all views are seen to be without any characteristics, they do not have any views. Instead, since there is no disturbance, this is referred to as the genuine view.

source: ཆོས་ཐམས་ཅད་མཐོང་བའི་ཚུལ་གྱིས་ལྟ་བ་ཞེས་བྱ་བ་དང་།
en: Since all phenomena are seen, this is known as the view.

source: མི་སྐྱེ་བ་ཐོབ་པའི་ཚུལ་གྱིས་ལམ་ཞེས་བྱ་བའམ།
en: As the unborn is attained, it is termed the path.

source: མཉམ་པ་ཉིད་ཀྱི་ཚུལ་གྱིས་ཡང་དག་པ་ཞེས་བྱ་བ་དང་།
en: In terms of sameness, it is known as the genuine mode.

source: སྒྲིབ་པ་མེད་པའི་ཚུལ་གྱིས་ལྟ་བ་ཞེས་བྱ་བ་དང་།
en: Being unobscured, it is referred to as the view.

source: ལམ་དང་ལམ་མ་ཡིན་པ་ཐམས་ཅད་ལ་འཇུག་པའི་ཚུལ་གྱིས་ལམ་ཞེས་བྱ་བ་
en: As it applies to all paths and non-paths, it is termed the path.

source: དེ་ནི་ཡང་དག་པའི་ལྟ་བ་ཞེས་བྱའོ།།གང་གཟུགས་ལ་རྟོག་པ་དང་། རྣམ་པར་རྟོག་པ་ཐམས་ཅད་གཅིག་པ་སྟེ།
en: “Correct conception occurs when all concepts and thoughts regarding form are the same.

source: འདི་ལྟ་སྟེ་དངོས་པོར་མི་རྟོག་པ་དང་དངོས་པོ་མེད་པར་མི་རྟོག་པ་དང་ཆད་པར་མི་རྟོག་པ་དང་། རྟག་པར་མི་རྟོག་པ་དང་སྐྱེ་བར་མི་རྟོག་པ་དང་མི་སྐྱེ་བར་མི་རྟོག་པ་དང་། རྟོག་པ་དང་མི་རྟོག་པ་ལ་མི་རྟོག་པ་དང་རྟོག་པ་མེད་པ་དང་རྣམ་པར་མི་རྟོག་པ་དང་། ཡང་དག་པའི་ལམ་ལ་མི་རྟོག་པ་
en: In that way, the bodhisattvas do not conceive of entities or non-entities, do not conceive of disruption or permanence, do not conceive of birth or non-birth, do not conceive of concepts or no concepts, and do not conceive of nonthought, nonconceptuality, or the correct path.

source: །གང་གཟུགས་ལ་ཆོས་ཐམས་ཅད་བརྗོད་དུ་མེད་པ་དང་བརྗོད་པ་མེད་པ་དང་། དབྱངས་དང་དབྱངས་མེད་པ་མཉམ་པ་ཉིད་དང་མིང་མེད་པ་དང་མིང་དུ་བརྗོད་པ་མེད་པ་དང་།
en: “Correct speech refers to knowing sameness in the sense that, with regard to form, all phenomena are beyond language and speech, pronunciation and non-pronunciation. They have no names and are unnamable.

source: ཚོལ་བ་མེད་པ་དང་ལམ་གྱི་ཡན་ལག་མ་ཡིན་པ་དང་ཡང་དག་པ་ཞེས་བྱ་བ་ངག་གི་ལམ་ཐམས་ཅད་ལ་ཀུན་ཏུ་མི་རྒྱུ་ཞིང་མི་རྗོད་པ་དང་། ལམ་ཞེས་བྱ་བའི་ཆོས་མ་ལུས་པ་བརྗོད་པ་
en: They are beyond examination and they are not the branches of the path. The word correct does not relate to any verbal mode and is not uttered. Still, all the qualities of the so-called path are uttered.

source: །གང་གཟུགས་ལ་ལས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ལ་ལས་མེད་པར་མངོན་པར་ཞེན་པ་འདི་ལྟ་སྟེ།
en: “Correct action is to view all actions with regard to form as non-actions.

source: མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་མངོན་པར་ཞེན་པ་དང་མངོན་པར་འདུ་བྱ་བ་མེད་པ་ཐོབ་པ་རྣམས་ལ་ཚོལ་བ་མེད་པ་དང་
en: They are not something that one performs, and they should therefore not be conceived of as such. Those who attain the state of not acting do not investigate.

source: ཡང་དག་པ་ཚོལ་བའམ།ལོག་པ་ཚོལ་བའམ། ལོག་པ་མ་ཡིན་པ་ཚོལ་བའམ། ལས་ཚོལ་བའམ། ལས་མ་ཡིན་པ་ཚོལ་བའམ།ལས་དང་ལས་མ་ཡིན་པ་ཐམས་ཅད་ཁས་མི་ལེན་པ་དེ་ནི་
en: They do not take up any type of investigation, such as wrong investigation, correct investigation, active investigation, non-active investigation, or any other type of action or non-action.

source: ངེས་པ་དང་མ་ངེས་པ་དང་། ཡང་དག་པ་ཉིད་དང་ལོག་པ་ཉིད་དང་དགེ་བ་དང་། མི་དགེ་བ་དང་ལུང་དུ་མི་སྟོན་པ་དང་། མི་གཡོ་བ་མངོན་པར་འདུ་མི་བྱེད་པ་དང་ལམ་དང་ལམ་མ་ཡིན་པ་མཐའ་ཡས་པ་སྐྱེ་བ་མེད་པར་བསྡུས་པ་དང་། མིག་ཡོར་ལྟ་བུའི་ཚུལ་གྱིས་ལས་ཀྱི་མཐའ་ཐམས་ཅད་མི་བྱེད་པས་ཡང་དག་པའི་ལས་ཀྱི་མཐའ་ཞེས་བྱའོ།།
en: In this way all the endless actions, whether certain, uncertain, correct, incorrect, virtuous, nonvirtuous, neutral, non-transferring, related to the path, or not related to the path, are seen to be unborn. Without engaging in any action, the bodhisattvas see all actions as optical illusions.

source: གང་གཟུགས་ལ་ཀུན་ཏུ་ལོངས་སྤྱོད་པ་དང་ཀུན་ཏུ་ལོངས་སྤྱོད་པ་མ་ཡིན་པ་ཤེས་པ་དང་། དེ་ལ་གནས་པ་ཆོས་ཀྱི་དབྱིངས་མཉམ་པ་ཉིད་ཀྱི་ཚུལ་གྱིས་ཡང་དག་པ་དང་།ལོག་པའི་ཚོར་བ་མི་དམིགས་པ་དང་མི་དམིགས་པས་འཚོ་བ་དང་། ལས་འཇིག་པ་དེ་ནི་ཡང་དག་པའི་འཚོ་བ་ཞེས་བྱ་སྟེ།
en: “Correct livelihood is to know the sameness of the pleasant and the unpleasant concerning form and to rest within the realm of phenomena without any observation of correct or incorrect livelihood. Being without observation in this way, livelihood and action fall away.

source: ཡང་དག་པ་ཞེས་བྱ་བ་དེ་ནི་མཉམ་པ་ཉིད་ཀྱི་ཚིག་གོ།
en: ‘Correct’ here means sameness.

source: །འཚོ་བ་ཞེས་བྱ་བ་དེ་ནི་འཕགས་པའི་ཆོས་འཛིན་པའི་ཚིག་གོ།
en: ‘Livelihood’ means upholding the Dharma of the noble ones.

source: །ལམ་ཞེས་བྱ་བ་དང་ལམ་མ་ཡིན་པ་ཞེས་བྱ་བ་དེ་ནི་མི་ཚོལ་བའི་དོན་གྱིས་ལམ་ཞེས་བྱའོ།
en: ‘Path’ and ‘non-path’ refer to the path that is free from striving.

source: །འཚོ་བ་དང་འཚོ་བ་མ་ཡིན་པའི་འདུ་ཤེས་ལ་རྣམ་པར་མི་རྟོག་པའི་དོན་གྱིས་འཚོ་བ་ཞེས་བྱའོ།
en: ‘Livelihood’ also refers to not having any thoughts or notions concerning livelihood or lack of livelihood.

source: །ཡང་དག་པ་ཞེས་བྱ་བ་དེ་ནི་མཉམ་པ་ཉིད་ལ་གནས་པ་ཞེས་བྱ་བའི་དོན་ཏེ།
en: ‘Correct’ means to abide within sameness.

source: དེ་ནི་ཡང་དག་པའི་འཚོ་བ་ཞེས་བྱའོ།
en: Such is correct livelihood.

source: །ཆོས་ཀྱི་དབྱིངས་མཉམ་པ་ཉིད་ཀྱི་ཚུལ་གྱིས་གང་གཟུགས་ལ་ལུས་དང་ངག་དང་ཡིད་ཀྱི་རྩོལ་བ་མེད་པ་ནི་ཆོས་ཀྱི་དབྱིངས་ལ་རྩོལ་བ་མེད་པ་སྟེ།
en: “Correct effort is to be effortless in body, speech, and mind concerning forms due to the sameness of the realm of phenomena. Thus, bodhisattvas are effortless with regard to the realm of phenomena.

source: ཡང་དག་པ་ཞེས་བྱ་བ་དེ་ནི་མི་སྐྱེ་བ་ལ་གནས་པའི་ཆོས་རྣམས་བླང་བ་མེད་པ་དང་། དོར་བ་མེད་པའི་ཚིག་བླ་དགས་སོ།
en: ‘Correct’ means free from accepting and rejecting any phenomena that abide within the unborn nature.

source: །རྩོལ་བ་མེད་པ་ཞེས་བྱ་བ་དེ་ནི་ལུས་དང་ངག་དང་ཡིད་མི་དམིགས་པའི་ཚིག་གོ།
en: ‘Effortless’ is a term for not having any observation in terms of body, speech, and mind.

source: །ལམ་ཞེས་བྱ་བ་དེ་ནི་བླང་བ་མེད་པ་དང་དོར་བ་མེད་པའི་ཚུལ་དང་། མི་ཚོལ་བའི་ཚུལ་གྱིས་འཕགས་པའི་དོན་ཚོལ་བ་སྟེ།
en: ‘Path’ means to strive for the objective of the noble ones via freedom from acceptance and rejection as well as to transcend striving.

source: །གང་གཟུགས་ལ་དྲན་པས་མི་དམིགས་པ་མཉམ་པ་ཉིད་ནི་དྲན་པ་མེད་པ་དྲན་པ་མེད་པའི་ཚུལ་གྱིས་དྲན་པ་ལ་སྦྱོར་བ་སྟེ།
en: “Correct mindfulness is to practice mindfulness of form by virtue of being without mindfulness. Such absence of mindfulness is sameness in which one rests without using mindfulness to objectify something.

source: ཡང་དག་པ་ཞེས་བྱ་བ་དེ་ནི་དམིགས་པ་མེད་པ་མཉམ་པ་ཉིད་སྒྲོ་བཏགས་པ་མེད་པའི་ཚིག་གོ།
en: ‘Correct’ is a term for the sameness in the absence of objectification beyond imputation.
